Maniak003/Meteostation/stm32cubeide/Meteostation/Meteostation.ioc
#MicroXplorer Configuration settings - do not modify
Mcu.Family=STM32F1
ProjectManager.MainLocation=Core/Src
RCC.MCOFreq_Value=64000000
PCC.Series=STM32F1
USART2.IPParameters=VirtualMode,BaudRate
ProjectManager.KeepUserCode=true
Mcu.UserName=STM32F103C8Tx
SPI2.VirtualType=VM_MASTER
PB10.Mode=I2C
PCC.Seq0.Step0.CPU_Frequency=64 MHz
PCC.Seq0.Step0.User's_Consumption=0 mA
RCC.PLLCLKFreq_Value=64000000
VP_IWDG_VS_IWDG.Mode=IWDG_Activate
PA12.GPIOParameters=GPIO_Speed,PinState,GPIO_Label
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-SystemClock_Config-RCC-false-HAL-false,3-MX_USART1_UART_Init-USART1-false-HAL-true,4-MX_I2C1_Init-I2C1-false-HAL-true,5-MX_SPI2_Init-SPI2-false-HAL-true,6-MX_IWDG_Init-IWDG-false-HAL-true,7-MX_I2C2_Init-I2C2-false-HAL-true,8-MX_USART2_UART_Init-USART2-false-HAL-true
RCC.ADCFreqValue=32000000
USART1.IPParameters=VirtualMode
PCC.Seq0.Step1.Duration=0.9 ms
PB11.Signal=I2C2_SDA
PB15.Signal=SPI2_MOSI
PB13.Signal=SPI2_SCK
PinOutPanel.RotationAngle=0
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
ProjectManager.StackSize=0x400
Mcu.IP4=RCC
RCC.FCLKCortexFreq_Value=64000000
Mcu.IP5=SPI2
I2C1.IPParameters=ClockSpeed,I2C_Mode
Mcu.IP2=IWDG
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PCC.Seq0.Step1.Oscillator=Regulator_LP
Mcu.IP3=NVIC
PB4.GPIOParameters=GPIO_Label
PA15.GPIO_Label=TP
Mcu.IP0=I2C1
PA12.Locked=true
Mcu.IP1=I2C2
PA12.Signal=GPIO_Output
SPI2.CLKPolarity=SPI_POLARITY_LOW
PCC.PartNumber=STM32F103C8Tx
Mcu.UserConstants=
I2C1.ClockSpeed=40000
Mcu.ThirdPartyNb=0
RCC.HCLKFreq_Value=64000000
Mcu.IPNb=9
ProjectManager.PreviousToolchain=
RCC.APB2TimFreq_Value=64000000
PB6.Signal=USART1_TX
PCC.Seq0.Step1.TaMax=105
PB6.Mode=Asynchronous
Mcu.Pin6=PB14
Mcu.Pin7=PB15
Mcu.Pin8=PA12
Mcu.Pin9=PA15
PCC.Seq0.Step1.Category=In DS Table
RCC.AHBFreq_Value=64000000
SPI2.BaudRatePrescaler=SPI_BAUDRATEPRESCALER_2
Mcu.Pin0=PA2
Mcu.Pin1=PA3
GPIO.groupedBy=Group By Peripherals
Mcu.Pin2=PB10
Mcu.Pin3=PB11
Mcu.Pin4=PB12
Mcu.Pin5=PB13
PA12.PinState=GPIO_PIN_RESET
ProjectManager.ProjectBuild=false
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PCC.Seq0.Step1.Vdd=3.3
PCC.Seq0.Step0.Voltage_Source=Battery
PCC.Seq0.Step0.DMIPS=61.0
NVIC.SysTick_IRQn=true\:0\:0\:false\:false\:true\:false\:true
RCC.PLLMUL=RCC_PLL_MUL16
PB12.GPIO_Label=Eth_CS
ProjectManager.FirmwarePackage=STM32Cube FW_F1 V1.8.4
MxDb.Version=DB.6.0.21
ProjectManager.BackupPrevious=false
PB14.Mode=Full_Duplex_Master
File.Version=6
SPI2.CalculateBaudRate=16.0 MBits/s
PB7.Signal=USART1_RX
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false
ProjectManager.HalAssertFull=false
ProjectManager.ProjectName=Meteostation
RCC.PLLMCOFreq_Value=32000000
PCC.Seq0.Step0.Oscillator=HSI PLL
Mcu.Package=LQFP48
PB9.Signal=I2C1_SDA
SPI2.Mode=SPI_MODE_MASTER
USART2.VirtualMode=VM_ASYNC
ProjectManager.ToolChainLocation=
PCC.Seq0.Step1.Average_Current=14 \u00B5A
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
PA15.Signal=GPIO_Output
PCC.Checker=false
SPI2.CLKPhase=SPI_PHASE_1EDGE
PCC.Seq0.Step0.Duration=0.1 ms
PCC.Seq0.Step1.DMIPS=0.0
RCC.APB1TimFreq_Value=64000000
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PCC.Seq0.Step0.Peripherals=
SPI2.Direction=SPI_DIRECTION_2LINES
PB13.Mode=Full_Duplex_Master
PCC.Seq0.Step1.Mode=STOP
ProjectManager.CustomerFirmwarePackage=
PA12.GPIO_Speed=GPIO_SPEED_FREQ_HIGH
PB4.Signal=GPIO_Output
PA3.Signal=USART2_RX
PCC.Seq0.Step1.CPU_Frequency=0 Hz
PCC.Seq0.Step1.Memory=n/a
PCC.Seq0.Step0.Category=In DS Table
ProjectManager.ProjectFileName=Meteostation.ioc
PB8.GPIOParameters=GPIO_Label
PB9.GPIO_Label=BME280_SDA
PA15.GPIOParameters=GPIO_Speed,PinState,GPIO_Label
Mcu.PinsNb=18
PCC.Seq0.Step0.Average_Current=23.9 mA
PCC.Vdd=3.3
ProjectManager.NoMain=false
ProjectManager.DefaultFWLocation=true
PB12.Locked=true
ProjectManager.DeletePrevious=true
PCC.Line=STM32F103
RCC.APB1CLKDivider=RCC_HCLK_DIV2
VP_SYS_VS_ND.Mode=No_Debug
USART2.BaudRate=9600
PA12.GPIO_Label=LED
RCC.FamilyName=M
PB9.GPIOParameters=GPIO_Label
PA3.Mode=Asynchronous
PB8.GPIO_Label=BME280_SCL
PCC.Seq0.Step0.TaMax=100.66
PCC.MCU=STM32F103C(8-B)Tx
PA15.Locked=true
PB11.Mode=I2C
ProjectManager.TargetToolchain=STM32CubeIDE
SPI2.CRCCalculation=SPI_CRCCALCULATION_DISABLE
PCC.Seq0.Step1.User's_Consumption=0 mA
I2C1.I2C_Mode=I2C_Standard
PCC.Seq0.Step0.Mode=RUN
PB9.Mode=I2C
SPI2.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate,FirstBit,BaudRatePrescaler,DataSize,CRCCalculation,CLKPolarity,CLKPhase
ProjectManager.RegisterCallBack=
RCC.USBFreq_Value=64000000
PB12.GPIO_Speed=GPIO_SPEED_FREQ_HIGH
PB10.Signal=I2C2_SCL
PB14.Signal=SPI2_MISO
board=custom
PCC.Temperature=25
ProjectManager.LastFirmware=true
PB15.Mode=Full_Duplex_Master
RCC.VCOOutput2Freq_Value=4000000
PA15.PinState=GPIO_PIN_RESET
RCC.APB2Freq_Value=64000000
PCC.Seq0.Step0.Frequency=8 MHz
PCC.Seq0.Step0.Vcore=No Scale
MxCube.Version=6.2.1
PB4.GPIO_Label=Eth_rst
VP_SYS_VS_Systick.Mode=SysTick
VP_SYS_VS_ND.Signal=SYS_VS_ND
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false
ProjectManager.FreePins=false
RCC.IPParameters=ADCFreqValue,AHBFreq_Value,APB1CLKDivider,APB1Freq_Value,APB1TimFreq_Value,APB2Freq_Value,APB2TimFreq_Value,FCLKCortexFreq_Value,FamilyName,HCLKFreq_Value,HSEDivPLL,MCOFreq_Value,PLLCLKFreq_Value,PLLMCOFreq_Value,PLLMUL,SYSCLKFreq_VALUE,SYSCLKSource,TimSysFreq_Value,USBFreq_Value,VCOOutput2Freq_Value
IWDG.IPParameters=Prescaler
ProjectManager.AskForMigrate=true
Mcu.Name=STM32F103C(8-B)Tx
PA2.Signal=USART2_TX
ProjectManager.UnderRoot=true
Mcu.IP8=USART2
Mcu.IP6=SYS
Mcu.IP7=USART1
ProjectManager.CoupleFile=false
PB4.Locked=true
PCC.Seq0.Step0.Memory=FLASH
RCC.SYSCLKFreq_VALUE=64000000
RCC.TimSysFreq_Value=64000000
NVIC.ForceEnableDMAVector=false
KeepUserPlacement=false
RCC.HSEDivPLL=RCC_HSE_PREDIV_DIV2
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false
SPI2.FirstBit=SPI_FIRSTBIT_MSB
USART1.VirtualMode=VM_ASYNC
ProjectManager.CompilerOptimize=6
PA15.GPIO_Speed=GPIO_SPEED_FREQ_HIGH
PB7.Mode=Asynchronous
VP_IWDG_VS_IWDG.Signal=IWDG_VS_IWDG
ProjectManager.HeapSize=0x200
Mcu.Pin15=VP_IWDG_VS_IWDG
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.Pin16=VP_SYS_VS_ND
Mcu.Pin13=PB8
Mcu.Pin14=PB9
ProjectManager.ComputerToolchain=false
Mcu.Pin17=VP_SYS_VS_Systick
PCC.Seq0.Step1.Frequency=0 Hz
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
Mcu.Pin11=PB6
Mcu.Pin12=PB7
PB8.Mode=I2C
Mcu.Pin10=PB4
IWDG.Prescaler=IWDG_PRESCALER_128
PCC.Seq0.Step1.Peripherals=
PA2.Mode=Asynchronous
PB8.Signal=I2C1_SCL
SPI2.DataSize=SPI_DATASIZE_8BIT
PCC.Seq0.Step1.Vcore=No Scale
PCC.Seq0.Step1.Voltage_Source=Battery
PCC.Seq0.Step0.Vdd=3.3
PCC.Seq0=2
RCC.APB1Freq_Value=32000000
ProjectManager.DeviceId=STM32F103C8Tx
PB12.GPIOParameters=GPIO_Speed,GPIO_Label
PB12.Signal=GPIO_Output
ProjectManager.LibraryCopy=1
isbadioc=false
